app/controllers/available_rides_controller.rb

UPDATE "rides" SET "updated_at" = $1, "status" = $2, "driver_id" = $3 WHERE "rides"."id" = $4  [["updated_at", "2024-11-02 10:20:29.847163"], ["status", 1], ["driver_id", 3], ["id", 1]]
---
  def create
    @ride = Ride.pending.find(params[:ride_id])
    @ride.update(driver_id: current_driver.id, status: :in_progress)