app/controllers/rides_controller.rb

  def index
    @rides = Ride.all
---
SELECT "rides".* FROM "rides"

  def create
    @ride = current_customer.rides.new(ride_params)

    respond_to do |format|
      if @ride.save
---
INSERT INTO "rides" ("pickup_location", "dropoff_location", "customer_id", "created_at", "updated_at", "status", "driver_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_ride
      @ride = Ride.find(params[:id])
---
SELECT "rides".* FROM "rides" WHERE "rides"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]